SiliconLabs/zigbee_applications/dmp_sed_light/EFR32MG12/src/dmp_sed_light_mg12_callbacks.c
  if (status != SL_STATUS_OK) {
    emberAfCorePrintln("Failed to readLightState");
  }
}

static void readTriggerSource(uint8_t connection)
{
  uint16_t sent_data_len;
  emberAfCorePrintln("Last event = %d\r\n", ble_lastEvent);

  /* Send response to read request */
  sl_status_t status =  sl_bt_gatt_server_send_user_read_response(connection,
                                                                  gattdb_trigger_source,
                                                                  ES_READ_OK,
                                                                  sizeof(ble_lastEvent),
                                                                  &ble_lastEvent,
                                                                  &sent_data_len);
  if (status != SL_STATUS_OK) {
    emberAfCorePrintln("Failed to readTriggerSource");
  }
}

static void readSourceAddress(uint8_t connection)
{
  uint16_t sent_data_len;
  emberAfCorePrintln("readSourceAddress");

  /* Send response to read request */
  sl_status_t status =  sl_bt_gatt_server_send_user_read_response(connection,
                                                                  gattdb_source_address,
                                                                  ES_READ_OK,
                                                                  sizeof(SourceAddress),
                                                                  SourceAddress,
                                                                  &sent_data_len);

  if (status != SL_STATUS_OK) {
    emberAfCorePrintln("Failed to readSourceAddress");
  }
}

static void writeLightState(uint8_t connection, uint8array *writeValue)
{
  emberAfCorePrintln("Light state write; %d\r\n", writeValue->data[0]);

  lightDirection = DMP_UI_DIRECTION_BLUETOOTH;

  emberAfWriteAttribute(emberAfPrimaryEndpoint(),
                        ZCL_ON_OFF_CLUSTER_ID,
                        ZCL_ON_OFF_ATTRIBUTE_ID,
                        CLUSTER_MASK_SERVER,
                        (int8u *) &writeValue->data[0],
                        ZCL_BOOLEAN_ATTRIBUTE_TYPE);

  sl_status_t status = sl_bt_gatt_server_send_user_write_response(connection,
                                                                  gattdb_light_state,
                                                                  ES_WRITE_OK);

  if (status != SL_STATUS_OK) {
    emberAfCorePrintln("Failed to writeLightState");
    return;
  }

  uint8_t index = bleConnectionInfoTableLookup(connection);

  if (index != 0xFF) {
    memset(SourceAddress, 0, sizeof(SourceAddress));
    for (int i = 0; i < SOURCE_ADDRESS_LEN - 2; i++) {
      SourceAddress[2 + i] =
        bleConnectionTable[index].remoteAddress[5 - i];
    }
  }
}

static void notifyLight(uint8_t lightState)
{
  ble_lightState = lightState;
  uint16_t sent_data_len;
  sl_status_t status;

  if (ble_lightState_config == gatt_indication) {
    emberAfCorePrintln("notifyLight : Light state = %d\r\n", lightState);
    /* Send notification/indication data */
    for (int i = 0; i < EMBER_AF_PLUGIN_BLE_MAX_CONNECTIONS; i++) {
      if (bleConnectionTable[i].inUse
          && bleConnectionTable[i].connectionHandle) {
        status = sl_bt_gatt_server_send_characteristic_notification(
          bleConnectionTable[i].connectionHandle,
          gattdb_light_state,
          sizeof(lightState),
          &lightState,
          &sent_data_len);
        if (status != SL_STATUS_OK) {
          emberAfCorePrintln("Failed to notifyLightState");
          return;
        }
      }
    }
  }
}

static void notifyTriggerSource(uint8_t connection, uint8_t triggerSource)
{
  sl_status_t status;
  uint16_t sent_data_len;
  if (ble_triggerSrc_config == gatt_indication) {
    emberAfCorePrintln("notifyTriggerSource :Last event = %d\r\n",
                       triggerSource);
    /* Send notification/indication data */
    status = sl_bt_gatt_server_send_characteristic_notification(connection,
                                                                gattdb_trigger_source,
                                                                sizeof(triggerSource),
                                                                &triggerSource,
                                                                &sent_data_len);

    if (status != SL_STATUS_OK) {
      emberAfCorePrintln("Failed to notifyTriggerSource");
      return;
    }
  }
}
static void notifySourceAddress(uint8_t connection)
{
  sl_status_t status;
  uint16_t sent_data_len;

  if (ble_triggerSrc_config == gatt_indication) {
    /* Send notification/indication data */
    status = sl_bt_gatt_server_send_characteristic_notification(connection,
                                                                gattdb_source_address,
                                                                sizeof(SourceAddress),
                                                                SourceAddress,
                                                                &sent_data_len);
    if (status != SL_STATUS_OK) {
      emberAfCorePrintln("Failed to notifySourceAddress");
      return;
    }
  }
}

static void toggleOnoffAttribute(void)
{
  EmberStatus status;
  int8u data;
  status = emberAfReadAttribute(emberAfPrimaryEndpoint(),
                                ZCL_ON_OFF_CLUSTER_ID,
                                ZCL_ON_OFF_ATTRIBUTE_ID,
                                CLUSTER_MASK_SERVER,
                                (int8u*) &data,
                                sizeof(data),
                                NULL);

  if (status == EMBER_ZCL_STATUS_SUCCESS) {
    if (data == 0x00) {
      data = 0x01;
    } else {
      data = 0x00;
    }

    lightDirection = DMP_UI_DIRECTION_SWITCH;
    emberAfGetEui64(lightEUI);
    for (int i = 0; i < SOURCE_ADDRESS_LEN; i++) {
      SourceAddress[i] = lightEUI[(SOURCE_ADDRESS_LEN - 1) - i];
    }
  } else {
    emberAfAppPrintln("read onoff attr: 0x%x", status);
  }

  status = emberAfWriteAttribute(emberAfPrimaryEndpoint(),
                                 ZCL_ON_OFF_CLUSTER_ID,
                                 ZCL_ON_OFF_ATTRIBUTE_ID,
                                 CLUSTER_MASK_SERVER,
                                 (int8u *) &data,
                                 ZCL_BOOLEAN_ATTRIBUTE_TYPE);
  emberAfAppPrintln("write to onoff attr: 0x%x", status);
}

