SiliconLabs/zigbee_applications/dmp_sed_light/EFR32MG12/src/dmp_sed_light_mg12_callbacks.c
  status = sl_bt_advertiser_set_timing(adv_handle[HANDLE_EDDYSTONE],   // handle
                                       (100 / 0.625), //100ms min adv interval in terms of 0.625ms
                                       (100 / 0.625), //100ms max adv interval in terms of 0.625ms
                                       0,   // duration : continue advertisement until stopped
                                       0);   // max_events :continue advertisement until stopped
  if (status != SL_STATUS_OK) {
    emberAfCorePrintln("Error eddystone sl_bt_advertiser_set_timing code: ", status);
    return;
  }

  status = sl_bt_advertiser_set_configuration(adv_handle[HANDLE_EDDYSTONE], LE_GAP_NON_RESOLVABLE);
  if (status != SL_STATUS_OK) {
    emberAfCorePrintln("Error eddystone sl_bt_advertiser_set_configuration code: ", status);
    return;
  }

  status = sl_bt_advertiser_start(adv_handle[HANDLE_EDDYSTONE],
                                  advertiser_user_data,
                                  advertiser_non_connectable);
  if (status != SL_STATUS_OK) {
    emberAfCorePrintln("Error eddystone sl_bt_advertiser_start code: ", status);
    return;
  }
}

static void enableBleAdvertisements(void)
{
  int16_t tx_power_set_value = 0;
  int16_t tx_power_get_value = 0xFF;
  sl_status_t status;

  /* Set transmit power to 0 dBm */
  status = sl_bt_system_set_max_tx_power(tx_power_set_value, &tx_power_get_value);
  if ( status != SL_STATUS_OK ) {
    emberAfCorePrintln("Unable to set Tx Power to %d. Errorcode:", tx_power_set_value, status);
    return;
  }

  /* Create the device Id and name based on the 16-bit truncated bluetooth address
     Copy to the local GATT database - this will be used by the BLE stack
     to put the local device name into the advertisements, but only if we are
     using default advertisements */
  uint16_t devId;
  bd_addr ble_address;
  static char devName[DEVNAME_LEN];

  status = sl_bt_system_get_identity_address(&ble_address, 0);   //0 : public address
  if ( status != SL_STATUS_OK ) {
    emberAfCorePrintln("Unable to get BLE address. Errorcode: %d", status);
    return;
  }
  devId = ((uint16_t)ble_address.addr[1] << 8) + (uint16_t)ble_address.addr[0];

  snprintf(devName, DEVNAME_LEN, DEVNAME, devId >> 8, devId & 0xff);
  emberAfCorePrintln("devName = %s", devName);
  status = sl_bt_gatt_server_write_attribute_value(gattdb_device_name,
                                                   0,
                                                   strnlen(devName, DEVNAME_LEN),
                                                   (uint8_t *)devName);

  if ( status != SL_STATUS_OK ) {
    emberAfCorePrintln("Unable to sl_bt_gatt_server_write_attribute_value device name. Errorcode: %d", status);
    return;
  }

  dmpUiSetBleDeviceName(devName);   //LCD display

  /* Copy the shortened device name to the response data, overwriting
     the default device name which is set at compile time */
  MEMCOPY(((uint8_t*) &responseData) + 5, devName, 8);

  /* Set the advertising data and scan response data*/
  /* Note that the Wireless Gecko mobile app filters by a specific UUID and
     if the advertising data is not set, the device will not be found on the app*/
  status = sl_bt_advertiser_set_data(adv_handle[HANDLE_DEMO],
                                     0,             //advertising packets
                                     sizeof(responseData),
                                     (uint8_t*) &responseData);

  if (status != SL_STATUS_OK) {
    emberAfCorePrintln("Unable to set adv data sl_bt_advertiser_set_data. Errorcode: %d", status);
    return;
  }

  status = sl_bt_advertiser_set_data(adv_handle[HANDLE_DEMO],
                                     1,             //scan response packets
                                     sizeof(responseData),
                                     (uint8_t*) &responseData);

  if (status != SL_STATUS_OK) {
    emberAfCorePrintln("Unable to set scan response data sl_bt_advertiser_set_data. Errorcode: %d", status);
    return;
  }

  /* Set advertising parameters : channel map, min, max intervals, etc */
  status = sl_bt_advertiser_set_channel_map(adv_handle[HANDLE_DEMO], 7);
  if (status != SL_STATUS_OK) {
    return;
  }

  status = sl_bt_advertiser_set_timing(adv_handle[HANDLE_DEMO],
                                       (100 / 0.625), //100ms min adv interval in terms of 0.625ms
                                       (100 / 0.625), //100ms max adv interval in terms of 0.625ms
                                       0,   // duration : continue advertisement until stopped
                                       0);   // max_events :continue advertisement until stopped
  if (status != SL_STATUS_OK) {
    return;
  }
  status = sl_bt_advertiser_set_report_scan_request(adv_handle[HANDLE_DEMO], 1);   //scan request reported as events
  if (status != SL_STATUS_OK) {
    return;
  }
  /* Start advertising in user mode and enable connections*/
  status = sl_bt_advertiser_start(adv_handle[HANDLE_DEMO],
                                  advertiser_user_data,
                                  advertiser_connectable_scannable);

  emberAfCorePrintln("BLE custom advertisements enabled");
  BeaconAdvertisements(devId);
}
